namespace ChangSha_Byd_NetCore8.Protocols.Common
{
    public class CommonEnum
    {
    }

    public enum PLCTaskType : ushort
    {
        无工作命令 = 0,
        入库作业 = 1,
        出库作业 = 2,
        直接出库 = 3,
        移库 = 4,
        更换仓位 = 5,
        盘点 = 7,
        回原点 = 8
    }

    public enum StockerStatus : ushort
    {
        关 = 0,
        维修 = 1,
        手动 = 2,
        半自动 = 3,
        自动 = 4,
        联机 = 5
    }

    public enum StockerTrip : ushort
    {
        无 = 0,
        待机 = 1,
        运行 = 2,
        异常 = 3
    }
    public enum StockerCargo : ushort
    {
        无 = 0,
        无货 = 1,
        有货 = 2

    }

    public enum StockerAction : ushort
    {
        无 = 0,
        前进 = 1,
        后退 = 2,
        上升 = 3,
        下降 = 4,
        左放货 = 5,
        左取货 = 6,
        右放货 = 7,
        右取货 = 8
    }

    public enum EnumAlarmError1
    {
        无 = 0,
        等待输送机允许伸叉信号 = 1,
        马达保护器异常 = 2,
        输送架交互信号确认超时 = 3,
        程序列数据错误 = 4,
        程序行走方向软极限设置错误 = 5,
        取货收回无货 = 6,
        走形后软极限异常 = 7,
        升降上极限开关异常 = 8,
        程序库位位置错误 = 9,
        程序起升方向软极限设置错误 = 10,
        货叉左软极限异常 = 11,
        货叉右软极限异常 = 12,
        通讯异常 = 13,
        程序起升方向运行参数错误 = 14,
        程序行走参数错误 = 15,
        超速异常 = 16
    }

    public enum EnumAlarmError2
    {
        无 = 0,
        行走方向前软极限错误 = 1,
        行走方向后软极限错误 = 2,
        行走方向前超速 = 3,
        行走方向后超速 = 4,
        行走方向电机刹车故障 = 5,
        行走方向电机刹车频繁 = 6,
        行走方向电机停车失败 = 7,
        行走方向电机低速超时 = 8,
        行走方向变频器断路跳闸 = 9,
        行走方向变频器未就绪 = 10,
        行走方向到达限位终点 = 11,
        行走方向换速点设置错误 = 12,
        行走方向测距仪返回数据为0 = 13,
        行走方向测距仪信号不稳定 = 14,
        行走方向距离值变化过大 = 15,
        行走方向电机赌转 = 16,
    }

    public enum EnumAlarmError3
    {
        无 = 0,
        行走方向货叉不在取货或放货位置 = 1,
        走形动作超时 = 2,
        升降动作超时 = 3,
        货叉动作超时 = 4,
        端点升降超时 = 5,
        端点升降过距离 = 6,
        取货左边单伸库满格 = 7,
        取货右边单伸库满格 = 8,
        走形前进时反转 = 9,
        走形后退时反转 = 10,
        升降上升时反转 = 11,
        升降下降时反转 = 12,
        校验超时 = 13,
        右叉取时反转 = 14,
        左边货物崩塌 = 15,
        右边货物崩塌 = 16,
    }

    public enum EnumAlarmError4
    {
        无 = 0,
        起升方向变频器断路器跳闸 = 1,
        起升方向上软极限错误 = 2,
        起升方向到达限位终点 = 3,
        起升方向换速点设置错误 = 4,
        起升方向测距仪故障 = 5,
        起升方向测距仪返回数据为0 = 6,
        起升方向测距仪信号不稳定 = 7,
        起升方向距离值变化过大 = 8,
        起升方向电机堵转 = 9,
        起升方向变频器未就绪 = 10,
        起升方向上超速 = 11,
        起升方向下超速 = 12,
        起升方向电机刹车故障 = 13,
        起升方向电机刹车频繁 = 14,
        起升方向电机低速超时 = 15,
        起升方向货叉不在取货或者放货位置 = 16,
    }

    public enum EnumAlarmError5
    {
        无 = 0,
        起升方向电机停车失败 = 1,
    }

    public enum Line5EnumAlarmError1
    {
        无 = 0,
        硬件通讯故障 = 1,
        行走软极限设置错误 = 2,
        起升软极限设置错误 = 3,
        库内列数据错误 = 4,
        库内起升层数据错误 = 5,
        行走变频器故障 = 6,
        升降变频器故障 = 7,
        货叉变频器故障 = 8,
        行走运行堵转 = 9,
        前软极限错误 = 10,
        后软极限错误 = 11,
        前超速 = 12,
        后超速 = 13,
        输送线门打开 = 14,
        与输送线通讯中断 = 15,
        行走变频器断路器跳闸 = 16
    }


    public enum Line5EnumAlarmError2
    {
        无 = 0,
        行走变频器未就绪 = 1,
        行走极限位终点 = 2,
        行走换速点错误 = 3,
        行走条码测距值0 = 4,
        WCS通讯中断 = 5,
        货叉1库位空出 = 6,
        货叉1货物丢失 = 7,
        货叉1满货位 = 8,
        货叉1放货失败 = 9,
        上位机下发报警 = 10,
        无1 = 11,
        无2 = 12,
        无3 = 13,
        无4 = 14,
        无5 = 15,
        无6 = 16,


    }

    public enum Line5EnumAlarmError3
    {
        无 = 0,
        行走不在停准位 = 1,
        起升变频器断路器跳闸 = 2,
        起升变频器未就绪 = 3,
        起升极限位终点 = 4,
        起升换速点错误 = 5,
        起升条码测距值0 = 6,
        起升不在停准位 = 7,
        货叉1电机M1变频器断路器跳闸 = 8,
        货叉1无位置信号 = 9,
        起升运行堵转 = 10,
        上软极限错误 = 11,
        下软极限错误 = 12,
        上超速 = 13,
        下超速 = 14,
        任务数据校验失败 = 15,
        任务数据不合法 = 16

    }

    public enum Line5EnumAlarmError4
    {
        无 = 0,
        货叉类型设定错误 = 1,
        来源和目标用的不是一类货叉 = 2,
        上位机缺少结束任务确认 = 3,
        取货第一目标不是滚床 = 4,
        放货第二目标不是滚床 = 5,
        移库任务目标出现滚床 = 6,
        前进障碍 = 7,
        后退障碍 = 8,
        货叉1货物不在中位 = 9,
        货叉1货物超高 = 10,
        货叉1货物前超限 = 11,
        货叉1货物后超限 = 12,
        货叉1货物左超高 = 13,
        货叉1货物右超高 = 14,
        货叉1货物右超差 = 15


    }

    public enum Line5EnumAlarmError5
    {
        无 = 0,
        货叉1货物左超差 = 1,
        货叉1目标物理位置值超出设定范围 = 2,
        货叉1电机M1运行超时 = 3,
        货叉1电机M1编码值0 = 4,
        货叉1目标物理位置值为0 = 5,
        货叉1左伸超限 = 6,
        货叉1右伸超限 = 7,
        前安全门打开 = 8,
        后安全门打开 = 9,
        安全光栅遮挡 = 10,
        RC安全继电器 = 11,
        MC安全继电器 = 12,
        HMI急停 = 13,
        SRM急停 = 14,
        模块故障 = 15,
        程序故障 = 16

    }


}